# Criando Nomes

In [1]:
import pandas as pd

In [8]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [10]:
print(f"Quatidade de nomes: {len(nomes_m) + len(nomes_f)}")

Quatidade de nomes: 400

In [11]:
frames = [nomes_f, nomes_m]

In [14]:
nomes = pd.concat(frames)['nome'].to_frame()

In [16]:
nomes.index = range(nomes.shape[0])

In [18]:
nomes

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
395     WALTER
396    ARLINDO
397    MICHAEL
398     ALVARO
399    GEOVANE

[400 rows x 1 columns]

# Incluid ID dos alunos

In [21]:
import numpy as np
np.random.seed(123)

In [22]:
total_alunos = len(nomes)

In [23]:
nomes["id_alunos"] = np.random.permutation(total_alunos) + 1

In [26]:
nomes.sample(5)

        nome  id_alunos
46   FABIANA        358
159    SELMA        118
3    ANTONIA        156
97   BARBARA        201
264   ROBSON        290

In [28]:
dominios = ['@dominioemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [29]:
nomes.sample(5)

         nome  id_alunos               dominio
390  NATANAEL         58   @servicodoemail.com
304  REINALDO         28   @servicodoemail.com
193  LUCILENE        146   @servicodoemail.com
98      THAIS        148  @dominioemail.com.br
202   ANTONIO        205  @dominioemail.com.br

In [47]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [48]:
nomes.sample(5)

       nome  id_alunos               dominio                      email
286   MAURO        251   @servicodoemail.com   mauro@servicodoemail.com
176    MARA        375  @dominioemail.com.br   mara@dominioemail.com.br
186    INES        319   @servicodoemail.com    ines@servicodoemail.com
62   FLAVIA         60   @servicodoemail.com  flavia@servicodoemail.com
240  SERGIO        139   @servicodoemail.com  sergio@servicodoemail.com